KCX-Mapping-Convert/testdaten/Export/KEX/06112011e.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
<ns2:submitToKcxRequest xmlns:ns2="http://www.kewill.com/schema/kids">
<shipment>
&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;Header&gt;&lt;ns2:Header xmlns:ns2="http://www.eBiz.com/schemas/header/200310/ "&gt;&lt;SentAt&gt;&lt;Date&gt;&lt;Year&gt;2012&lt;/Year&gt;&lt;Month&gt;1&lt;/Month&gt;&lt;Day&gt;6&lt;/Day&gt;&lt;/Date&gt;&lt;Time&gt;2012-01-06 12:01:704&lt;/Time&gt;&lt;/SentAt&gt;&lt;Transmitter&gt;DE.KEX.TST&lt;/Transmitter&gt;&lt;Receiver&gt;DE.KEX.TST&lt;/Receiver&gt;&lt;Method&gt;ELP&lt;/Method&gt;&lt;MessageTP&gt;&lt;CountryCode&gt;GB&lt;/CountryCode&gt;&lt;Procedure&gt;EXPORT&lt;/Procedure&gt;&lt;ProcedureSpecification&gt;LCP&lt;/ProcedureSpecification&gt;&lt;MessageName&gt;PreNotification&lt;/MessageName&gt;&lt;Release&gt;1.0.00&lt;/Release&gt;&lt;Direction&gt;FROM_CUSTOMER&lt;/Direction&gt;&lt;/MessageTP&gt;&lt;MessageID&gt;06112011E20120106-1209&lt;/MessageID&gt;&lt;/ns2:Header&gt;&lt;ns2:shheader xmlns:ns2="http://www.kewill.com/schema/shipment1"&gt;&lt;shdeclarations&gt;&lt;declarationUnid&gt;84638&lt;/declarationUnid&gt;&lt;declarationtype&gt;INVOICE&lt;/declarationtype&gt;&lt;declarationcode&gt;Origin&lt;/declarationcode&gt;&lt;declarationtext&gt;WE HEREBY CERTIFY THAT THE GOODS ENUMERATED ON THIS INVOICE ARE OF UNITED KINGDOM ORIGIN AND MANUFACTURE. MANUFACTURED BY KEWILL PLC, BRAMLEY HOUSE, GUILDFORD, GU3 1LR.
WE ALSO CERTIFY THAT THIS INVOICE IS TRUE AND CORRECT AND MATERIALS ARE IN ACCORDANCE WITH OUR RECORDED SPECIFICATIONS.
FOR KEWILL PLC

SIGNATORY&lt;/declarationtext&gt;&lt;/shdeclarations&gt;&lt;shdeclarations&gt;&lt;declarationUnid&gt;84639&lt;/declarationUnid&gt;&lt;declarationtype&gt;PACKING&lt;/declarationtype&gt;&lt;declarationcode&gt;Pack1&lt;/declarationcode&gt;&lt;declarationtext&gt;WE CERTIFY THAT THE PACKING MATERIALS ARE FREE FROM BARK AND UNTREATED WOOD.
FOR KEWIL PLC

SIGNATORY&lt;/declarationtext&gt;&lt;/shdeclarations&gt;&lt;shsignatures&gt;&lt;signatureUnid&gt;84640&lt;/signatureUnid&gt;&lt;signatorytype&gt;INVOICE&lt;/signatorytype&gt;&lt;signatorycode&gt;SJH&lt;/signatorycode&gt;&lt;signaturecompanyname&gt;KEWILL PLC&lt;/signaturecompanyname&gt;&lt;signatoryname&gt;S.J. HOWSON&lt;/signatoryname&gt;&lt;signatoryplaceofissue&gt;GUILDFORD&lt;/signatoryplaceofissue&gt;&lt;signatoryphoneno&gt;+44 1483 406000&lt;/signatoryphoneno&gt;&lt;signatoryfaxno&gt;+44 1483 406001&lt;/signatoryfaxno&gt;&lt;signatoryemailid&gt;steve.howson@kewill.com&lt;/signatoryemailid&gt;&lt;signatorytitleposition&gt;CHIEF ADMINISTRATOR&lt;/signatorytitleposition&gt;&lt;/shsignatures&gt;&lt;shtermses&gt;&lt;termsUnid&gt;84643&lt;/termsUnid&gt;&lt;termtypecode&gt;PAYMENT&lt;/termtypecode&gt;&lt;termcode&gt;30&lt;/termcode&gt;&lt;termtext&gt;30 days&lt;/termtext&gt;&lt;/shtermses&gt;&lt;shtermses&gt;&lt;termsUnid&gt;84644&lt;/termsUnid&gt;&lt;termtypecode&gt;DELIVERY&lt;/termtypecode&gt;&lt;termcode&gt;CFR&lt;/termcode&gt;&lt;termtext&gt;CFR SINGAPORE&lt;/termtext&gt;&lt;deliverytermincoterm&gt;CFR&lt;/deliverytermincoterm&gt;&lt;deliverytermintrastat&gt;CFR&lt;/deliverytermintrastat&gt;&lt;/shtermses&gt;&lt;shcustomsaitexts&gt;&lt;shaitextUnid&gt;84637&lt;/shaitextUnid&gt;&lt;aicode&gt;GRNTR&lt;/aicode&gt;&lt;aitext1&gt;GBWK554690029&lt;/aitext1&gt;&lt;/shcustomsaitexts&gt;&lt;shintrastats&gt;&lt;unid&gt;84656&lt;/unid&gt;&lt;/shintrastats&gt;&lt;shuscustoms&gt;&lt;uscustomsUnid&gt;84658&lt;/uscustomsUnid&gt;&lt;sedtransactrelatedyn&gt;false&lt;/sedtransactrelatedyn&gt;&lt;sedroutedyn&gt;false&lt;/sedroutedyn&gt;&lt;sedcontainerizedyn&gt;false&lt;/sedcontainerizedyn&gt;&lt;sedsoldenrouteyn&gt;false&lt;/sedsoldenrouteyn&gt;&lt;sedresponsereceived&gt;false&lt;/sedresponsereceived&gt;&lt;sedbgjobnohandsfree&gt;0&lt;/sedbgjobnohandsfree&gt;&lt;sedmixedflag&gt;false&lt;/sedmixedflag&gt;&lt;/shuscustoms&gt;&lt;sheucustoms&gt;&lt;eucustomsUnid&gt;84655&lt;/eucustomsUnid&gt;&lt;officeofdespatchsadboxa&gt;GB000051&lt;/officeofdespatchsadboxa&gt;&lt;saddeclarationdivision2&gt;D&lt;/saddeclarationdivision2&gt;&lt;euducr&gt;2GBGB6088818070-9&lt;/euducr&gt;&lt;locationofgoodscode&gt;LEF&lt;/locationofgoodscode&gt;&lt;transportidatdep&gt;123123RT5&lt;/transportidatdep&gt;&lt;transportidatbord&gt;SEAFREIGHT&lt;/transportidatbord&gt;&lt;declarationtype&gt;EFD&lt;/declarationtype&gt;&lt;methodofpayment&gt;Y&lt;/methodofpayment&gt;&lt;singletransportcontract&gt;true&lt;/singletransportcontract&gt;&lt;transportmotborder&gt;1&lt;/transportmotborder&gt;&lt;transportmotdepart&gt;3&lt;/transportmotdepart&gt;&lt;/sheucustoms&gt;&lt;shdocumentgrid&gt;&lt;unid&gt;84654&lt;/unid&gt;&lt;/shdocumentgrid&gt;&lt;shtaxes&gt;&lt;taxUnid&gt;84642&lt;/taxUnid&gt;&lt;totamntpertaxrate&gt;125&lt;/totamntpertaxrate&gt;&lt;tottaxpertaxrate&gt;0&lt;/tottaxpertaxrate&gt;&lt;categoryoftax&gt;I&lt;/categoryoftax&gt;&lt;taxratecode&gt;0&lt;/taxratecode&gt;&lt;taxratepercent&gt;0&lt;/taxratepercent&gt;&lt;currencycode&gt;GBP&lt;/currencycode&gt;&lt;/shtaxes&gt;&lt;shbankcollect&gt;&lt;unid&gt;84653&lt;/unid&gt;&lt;/shbankcollect&gt;&lt;shaddresses&gt;&lt;addressUnid&gt;84635&lt;/addressUnid&gt;&lt;shipmentaddresstypecode&gt;CONSIGNEE&lt;/shipmentaddresstypecode&gt;&lt;addresscode&gt;Importers&lt;/addresscode&gt;&lt;shortname&gt;Importers&lt;/shortname&gt;&lt;freeformataddress&gt;IMPORTERS INCORPORATED INC
70 UBI CRESCENT
1-10 UBI TECHPARK
SINGAPORE&lt;/freeformataddress&gt;&lt;/shaddresses&gt;&lt;shaddresses&gt;&lt;addressUnid&gt;84632&lt;/addressUnid&gt;&lt;shipmentaddresstypecode&gt;EXPORTER&lt;/shipmentaddresstypecode&gt;&lt;addresscode&gt;Kewill&lt;/addresscode&gt;&lt;shortname&gt;Kewill&lt;/shortname&gt;&lt;vattaxregistrationcode&gt;GB608881807&lt;/vattaxregistrationcode&gt;&lt;freeformataddress&gt;Kewill plc	
Bramley House	
The Guildway
Artington
Giuldford
GU3 1LR&lt;/freeformataddress&gt;&lt;eorino&gt;GB608881807&lt;/eorino&gt;&lt;eoribranch&gt;000&lt;/eoribranch&gt;&lt;/shaddresses&gt;&lt;shaddresses&gt;&lt;addressUnid&gt;84633&lt;/addressUnid&gt;&lt;shipmentaddresstypecode&gt;AGENTS&lt;/shipmentaddresstypecode&gt;&lt;addresscode&gt;FWDR&lt;/addresscode&gt;&lt;shortname&gt;UKFWDER&lt;/shortname&gt;&lt;freeformataddress&gt;FORWARDERS INTERNATIONAL LTD, 5 PORT ROAD, TERMINAL TERRACE, SOUTHAMPTON, HANTS.&lt;/freeformataddress&gt;&lt;/shaddresses&gt;&lt;shaddresses&gt;&lt;addressUnid&gt;84636&lt;/addressUnid&gt;&lt;shipmentaddresstypecode&gt;WAREHOUSE&lt;/shipmentaddresstypecode&gt;&lt;addresscode&gt;Premises&lt;/addresscode&gt;&lt;shortname&gt;Premises&lt;/shortname&gt;&lt;customswarehouseidshortname&gt;YGB00004476115GB&lt;/customswarehouseidshortname&gt;&lt;freeformataddress&gt;Kewil PLC
Bramley House
Guildford
Surrey,GU3 1LR&lt;/freeformataddress&gt;&lt;/shaddresses&gt;&lt;shaddresses&gt;&lt;addressUnid&gt;84634&lt;/addressUnid&gt;&lt;shipmentaddresstypecode&gt;FORWARDER&lt;/shipmentaddresstypecode&gt;&lt;addresscode&gt;FWDR&lt;/addresscode&gt;&lt;shortname&gt;UKFWDER&lt;/shortname&gt;&lt;freeformataddress&gt;FORWARDERS INTERNATIONAL LTD, 5 PORT ROAD, TERMINAL TERRACE, SOUTHAMPTON, HANTS.&lt;/freeformataddress&gt;&lt;/shaddresses&gt;&lt;shsli&gt;&lt;deliverytermincoterm&gt;CFR&lt;/deliverytermincoterm&gt;&lt;unid&gt;84657&lt;/unid&gt;&lt;/shsli&gt;&lt;sicommercialitems&gt;&lt;commercialitemUnid&gt;84647&lt;/commercialitemUnid&gt;&lt;countryoforigincode&gt;GB&lt;/countryoforigincode&gt;&lt;commercialitemSno&gt;1&lt;/commercialitemSno&gt;&lt;deleteflag&gt;true&lt;/deleteflag&gt;&lt;productcodesku&gt;PROD123&lt;/productcodesku&gt;&lt;descriptioninvoiceline&gt;EXPORT PRODUCT  12X24 UNITS&lt;/descriptioninvoiceline&gt;&lt;quantityconversionsign&gt;*&lt;/quantityconversionsign&gt;&lt;quantityconversionfactor&gt;1&lt;/quantityconversionfactor&gt;&lt;quantityinvoiceline&gt;1500&lt;/quantityinvoiceline&gt;&lt;quantityuom&gt;1&lt;/quantityuom&gt;&lt;unitpriceinvoiceline&gt;15&lt;/unitpriceinvoiceline&gt;&lt;unitpriceuom&gt;EACH&lt;/unitpriceuom&gt;&lt;totalpriceforline&gt;22500&lt;/totalpriceforline&gt;&lt;grossweightinvoiceline&gt;2000&lt;/grossweightinvoiceline&gt;&lt;netweightinvoiceline&gt;1500&lt;/netweightinvoiceline&gt;&lt;palletnumberfrominvoiceline&gt;1&lt;/palletnumberfrominvoiceline&gt;&lt;palletnumbertoinvoicelist&gt;1&lt;/palletnumbertoinvoicelist&gt;&lt;uomnetweightper&gt;1&lt;/uomnetweightper&gt;&lt;natureoftransivl&gt;10&lt;/natureoftransivl&gt;&lt;taxratecodeforinvoiceivl&gt;0&lt;/taxratecodeforinvoiceivl&gt;&lt;taxrateercent&gt;0&lt;/taxrateercent&gt;&lt;commoditycodeinvoice&gt;85086000&lt;/commoditycodeinvoice&gt;&lt;customsregimeivl&gt;1000001&lt;/customsregimeivl&gt;&lt;licenceexceptionflag&gt;0&lt;/licenceexceptionflag&gt;&lt;currencycode&gt;GBP&lt;/currencycode&gt;&lt;/sicommercialitems&gt;&lt;sicommercialitems&gt;&lt;commercialitemUnid&gt;84645&lt;/commercialitemUnid&gt;&lt;countryoforigincode&gt;GB&lt;/countryoforigincode&gt;&lt;commercialitemSno&gt;2&lt;/commercialitemSno&gt;&lt;deleteflag&gt;true&lt;/deleteflag&gt;&lt;productcodesku&gt;PROD123&lt;/productcodesku&gt;&lt;descriptioninvoiceline&gt;EXPORT PRODUCT  12X24 UNITS&lt;/descriptioninvoiceline&gt;&lt;quantityconversionsign&gt;*&lt;/quantityconversionsign&gt;&lt;quantityconversionfactor&gt;1&lt;/quantityconversionfactor&gt;&lt;quantityinvoiceline&gt;250&lt;/quantityinvoiceline&gt;&lt;quantityuom&gt;1&lt;/quantityuom&gt;&lt;unitpriceinvoiceline&gt;20&lt;/unitpriceinvoiceline&gt;&lt;unitpriceuom&gt;EACH&lt;/unitpriceuom&gt;&lt;totalpriceforline&gt;5000&lt;/totalpriceforline&gt;&lt;grossweightinvoiceline&gt;300&lt;/grossweightinvoiceline&gt;&lt;netweightinvoiceline&gt;250&lt;/netweightinvoiceline&gt;&lt;uomnetweightper&gt;1&lt;/uomnetweightper&gt;&lt;natureoftransivl&gt;10&lt;/natureoftransivl&gt;&lt;taxratecodeforinvoiceivl&gt;0&lt;/taxratecodeforinvoiceivl&gt;&lt;taxrateercent&gt;0&lt;/taxrateercent&gt;&lt;commoditycodeinvoice&gt;48176000&lt;/commoditycodeinvoice&gt;&lt;customsregimeivl&gt;1000001&lt;/customsregimeivl&gt;&lt;licenceexceptionflag&gt;0&lt;/licenceexceptionflag&gt;&lt;currencycode&gt;GBP&lt;/currencycode&gt;&lt;/sicommercialitems&gt;&lt;sicommercialitems&gt;&lt;commercialitemUnid&gt;84646&lt;/commercialitemUnid&gt;&lt;countryoforigincode&gt;GB&lt;/countryoforigincode&gt;&lt;commercialitemSno&gt;3&lt;/commercialitemSno&gt;&lt;deleteflag&gt;false&lt;/deleteflag&gt;&lt;productcodesku&gt;Scotch&lt;/productcodesku&gt;&lt;descriptioninvoiceline&gt;Scotch Whisky 12x75ml Bottles&lt;/descriptioninvoiceline&gt;&lt;quantityconversionsign&gt;*&lt;/quantityconversionsign&gt;&lt;quantityconversionfactor&gt;1&lt;/quantityconversionfactor&gt;&lt;quantityinvoiceline&gt;5&lt;/quantityinvoiceline&gt;&lt;quantityuom&gt;Case&lt;/quantityuom&gt;&lt;unitpriceinvoiceline&gt;25&lt;/unitpriceinvoiceline&gt;&lt;unitpriceuom&gt;Case&lt;/unitpriceuom&gt;&lt;totalpriceforline&gt;125&lt;/totalpriceforline&gt;&lt;grossweightinvoiceline&gt;62.5&lt;/grossweightinvoiceline&gt;&lt;netweightinvoiceline&gt;50&lt;/netweightinvoiceline&gt;&lt;volumeinvoiceline&gt;7.5&lt;/volumeinvoiceline&gt;&lt;uomgrossweightper&gt;12.5&lt;/uomgrossweightper&gt;&lt;uomnetweightper&gt;10&lt;/uomnetweightper&gt;&lt;uomvolumeper&gt;1.5&lt;/uomvolumeper&gt;&lt;natureoftransivl&gt;10&lt;/natureoftransivl&gt;&lt;dimensionslengthivl&gt;1.5&lt;/dimensionslengthivl&gt;&lt;dimensionswidthivl&gt;1.5&lt;/dimensionswidthivl&gt;&lt;dimensionsheightivl&gt;1.5&lt;/dimensionsheightivl&gt;&lt;taxratecodeforinvoiceivl&gt;0&lt;/taxratecodeforinvoiceivl&gt;&lt;taxrateercent&gt;0&lt;/taxrateercent&gt;&lt;commoditycodeinvoice&gt;22083071&lt;/commoditycodeinvoice&gt;&lt;customsq2ivlperuom&gt;3.6&lt;/customsq2ivlperuom&gt;&lt;customsq2unitivl&gt;Ltrs&lt;/customsq2unitivl&gt;&lt;customsq3ivlperuom&gt;9&lt;/customsq3ivlperuom&gt;&lt;customsq3unit&gt;Ltrs&lt;/customsq3unit&gt;&lt;customsregimeivl&gt;1007001&lt;/customsregimeivl&gt;&lt;licenceexceptionflag&gt;0&lt;/licenceexceptionflag&gt;&lt;bottlesperitems&gt;12&lt;/bottlesperitems&gt;&lt;litresperbottleitem&gt;0.75&lt;/litresperbottleitem&gt;&lt;alcoholpercentage&gt;40&lt;/alcoholpercentage&gt;&lt;alcohollitres&gt;0.3&lt;/alcohollitres&gt;&lt;currencycode&gt;GBP&lt;/currencycode&gt;&lt;/sicommercialitems&gt;&lt;sicustomitems&gt;&lt;sicustomsdocs&gt;&lt;sidocumentUnid&gt;84649&lt;/sidocumentUnid&gt;&lt;/sicustomsdocs&gt;&lt;sicustomsdocs&gt;&lt;sidocumentUnid&gt;84650&lt;/sidocumentUnid&gt;&lt;prevdoctype&gt;AADF&lt;/prevdoctype&gt;&lt;prevdocref&gt;525345346567&lt;/prevdocref&gt;&lt;prevdocclass&gt;Z&lt;/prevdocclass&gt;&lt;/sicustomsdocs&gt;&lt;sicustomsdocs&gt;&lt;sidocumentUnid&gt;84651&lt;/sidocumentUnid&gt;&lt;prevdoctype&gt;AAD&lt;/prevdoctype&gt;&lt;prevdocref&gt;3423422342123&lt;/prevdocref&gt;&lt;prevdocclass&gt;Z&lt;/prevdocclass&gt;&lt;/sicustomsdocs&gt;&lt;customitemUnid&gt;84648&lt;/customitemUnid&gt;&lt;sicustomsmessage&gt;&lt;customsmessageUnid&gt;84652&lt;/customsmessageUnid&gt;&lt;officeofexport&gt;GB000051&lt;/officeofexport&gt;&lt;methodofpayment&gt;Y&lt;/methodofpayment&gt;&lt;singletransportcontract&gt;true&lt;/singletransportcontract&gt;&lt;/sicustomsmessage&gt;&lt;originatinginvoicelinenumber&gt;10&lt;/originatinginvoicelinenumber&gt;&lt;noofpackagesfromcustoms&gt;0&lt;/noofpackagesfromcustoms&gt;&lt;kindofpackagescustoms&gt;Case&lt;/kindofpackagescustoms&gt;&lt;kindofpackagescodecustoms&gt;CS&lt;/kindofpackagescodecustoms&gt;&lt;descriptionofgoodscustoms&gt;Scotch Whisky 12x75ml Bottles&lt;/descriptionofgoodscustoms&gt;&lt;commoditycode&gt;22083071&lt;/commoditycode&gt;&lt;grossweightcustoms&gt;62.5&lt;/grossweightcustoms&gt;&lt;netweightcustoms&gt;50&lt;/netweightcustoms&gt;&lt;legalweightcustomsitem&gt;0&lt;/legalweightcustomsitem&gt;&lt;volumecustomsitem&gt;7.5&lt;/volumecustomsitem&gt;&lt;customscurrency&gt;GBP&lt;/customscurrency&gt;&lt;statisticsvaluecustomsitem&gt;125&lt;/statisticsvaluecustomsitem&gt;&lt;fiscalvaluecustomsitem&gt;0&lt;/fiscalvaluecustomsitem&gt;&lt;customsregimecus&gt;1007001&lt;/customsregimecus&gt;&lt;supplementaryunitscustomsq2&gt;18&lt;/supplementaryunitscustomsq2&gt;&lt;supplymentaryuomcustomsq2&gt;Ltrs&lt;/supplymentaryuomcustomsq2&gt;&lt;quantity3&gt;45&lt;/quantity3&gt;&lt;quantity3Unit&gt;Ltrs&lt;/quantity3Unit&gt;&lt;countryoforigincode&gt;GB&lt;/countryoforigincode&gt;&lt;transactioncodenot&gt;10&lt;/transactioncodenot&gt;&lt;alcoholpercentcus&gt;40&lt;/alcoholpercentcus&gt;&lt;alcohollitrescus&gt;0.3&lt;/alcohollitrescus&gt;&lt;sedlicenseexemptionindicator&gt;0&lt;/sedlicenseexemptionindicator&gt;&lt;/sicustomitems&gt;&lt;unid&gt;84631&lt;/unid&gt;&lt;ownerid&gt;testGroup&lt;/ownerid&gt;&lt;transactionref&gt;06112011e&lt;/transactionref&gt;&lt;orderdate&gt;2011-12-12T00:00:00Z&lt;/orderdate&gt;&lt;createdate&gt;2011-12-12T12:52:11Z&lt;/createdate&gt;&lt;despatchdate&gt;2011-12-14T00:00:00Z&lt;/despatchdate&gt;&lt;customerporef&gt;PO34323&lt;/customerporef&gt;&lt;exporterref&gt;06112011&lt;/exporterref&gt;&lt;invoicenumber&gt;123453240&lt;/invoicenumber&gt;&lt;salesordernumber&gt;234DG54545&lt;/salesordernumber&gt;&lt;portofloading&gt;FELIXSTOWE&lt;/portofloading&gt;&lt;portofloadingcode&gt;FXT&lt;/portofloadingcode&gt;&lt;portofdischarge&gt;SINGAPORE&lt;/portofdischarge&gt;&lt;portofdischargecode&gt;SCT&lt;/portofdischargecode&gt;&lt;placeofdelivery&gt;SINGAPORE&lt;/placeofdelivery&gt;&lt;placeofdeliverycode&gt;SIN&lt;/placeofdeliverycode&gt;&lt;countryofdespatch&gt;UNITED KINGDOM&lt;/countryofdespatch&gt;&lt;countryofdespatchcode&gt;GB&lt;/countryofdespatchcode&gt;&lt;containerprefix&gt;CTIU&lt;/containerprefix&gt;&lt;containernumber&gt;12343332&lt;/containernumber&gt;&lt;sealnumber1&gt;12ER5587&lt;/sealnumber1&gt;&lt;descofgoodsheader&gt;DOMESTIC APPLIANCES&lt;/descofgoodsheader&gt;&lt;weightunitindicatorkglb&gt;KG&lt;/weightunitindicatorkglb&gt;&lt;deleteflag&gt;false&lt;/deleteflag&gt;&lt;totnoivl&gt;1&lt;/totnoivl&gt;&lt;totnocus&gt;1&lt;/totnocus&gt;&lt;totalgrossweightinvoice&gt;62.5&lt;/totalgrossweightinvoice&gt;&lt;totalnetweightinvoice&gt;50&lt;/totalnetweightinvoice&gt;&lt;totalvolinvoice&gt;7.5&lt;/totalvolinvoice&gt;&lt;totalgrossweightcustoms&gt;62.500000&lt;/totalgrossweightcustoms&gt;&lt;totalnetweightcustoms&gt;50.000000&lt;/totalnetweightcustoms&gt;&lt;totalvolcustoms&gt;7.500000&lt;/totalvolcustoms&gt;&lt;invinvoicelinestotal&gt;125&lt;/invinvoicelinestotal&gt;&lt;invinvoiceamounttotal&gt;125.000&lt;/invinvoiceamounttotal&gt;&lt;headercurrency&gt;GBP&lt;/headercurrency&gt;&lt;motcode&gt;1&lt;/motcode&gt;&lt;containersize&gt;20ft general&lt;/containersize&gt;&lt;/ns2:shheader&gt;&lt;/Header&gt;
</shipment>
</ns2:submitToKcxRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>